Revit 2024 API
DuctSizeIterator.Reset Method
 Resets the iterator to the initial state.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public virtual void Reset()
Visual Basic
Public Overridable Sub Reset
Visual C++
public:
virtual void Reset()
See Also
DuctSizeIterator Class
Autodesk.Revit.DB.Mechanical Namespace